{".class":"MypyFile","_fullname":"peft.tuners.adalora.config","future_import_flags":[],"is_partial_stub_package":false,"is_stub":false,"names":{".class":"SymbolTable","AdaLoraConfig":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":["peft.tuners.lora.config.LoraConfig"],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"peft.tuners.adalora.config.AdaLoraConfig","name":"AdaLoraConfig","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":[],"fullname":"peft.tuners.adalora.config.AdaLoraConfig","has_param_spec_type":false,"metaclass_type":null,"metadata":{"dataclass":{"attributes":[{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":311,"name":"task_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":310,"name":"peft_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":60,"name":"auto_mapping","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":306,"name":"base_model_name_or_path","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":309,"name":"revision","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":312,"name":"inference_mode","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":326,"name":"r","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":327,"name":"target_modules","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":342,"name":"exclude_modules","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":346,"name":"lora_alpha","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":347,"name":"lora_dropout","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":348,"name":"fan_in_fan_out","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":352,"name":"bias","type":{".class":"UnionType","items":[{".class":"LiteralType","fallback":"builtins.str","value":"none"},{".class":"LiteralType","fallback":"builtins.str","value":"all"},{".class":"LiteralType","fallback":"builtins.str","value":"lora_only"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":355,"name":"use_rslora","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":366,"name":"modules_to_save","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":374,"name":"init_lora_weights","type":{".class":"UnionType","items":["builtins.bool",{".class":"LiteralType","fallback":"builtins.str","value":"gaussian"},{".class":"LiteralType","fallback":"builtins.str","value":"eva"},{".class":"LiteralType","fallback":"builtins.str","value":"olora"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa_niter_[number of iters]"},{".class":"LiteralType","fallback":"builtins.str","value":"corda"},{".class":"LiteralType","fallback":"builtins.str","value":"loftq"},{".class":"LiteralType","fallback":"builtins.str","value":"orthogonal"}],"uses_pep604_syntax":true}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":400,"name":"layers_to_transform","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":407,"name":"layers_pattern","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":68,"name":"rank_pattern","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":424,"name":"alpha_pattern","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":433,"name":"megatron_config","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":449,"name":"megatron_core","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":459,"name":"trainable_token_indices","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"Instance","args":["builtins.str",{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":474,"name":"loftq_config","type":{".class":"UnionType","items":["peft.tuners.lora.config.LoftQConfig",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":483,"name":"eva_config","type":{".class":"UnionType","items":["peft.tuners.lora.config.EvaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":492,"name":"corda_config","type":{".class":"UnionType","items":["peft.tuners.lora.config.CordaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":501,"name":"use_dora","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":513,"name":"use_qalora","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":524,"name":"qalora_group_size","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":537,"name":"layer_replication","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":556,"name":"runtime_config","type":"peft.tuners.lora.config.LoraRuntimeConfig"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":559,"name":"lora_bias","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":569,"name":"target_parameters","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":59,"name":"target_r","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":60,"name":"init_r","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":61,"name":"tinit","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":62,"name":"tfinal","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":63,"name":"deltaT","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":64,"name":"beta1","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":65,"name":"beta2","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":66,"name":"orth_reg_weight","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":67,"name":"total_step","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}],"frozen":false},"dataclass_tag":{}},"module_name":"peft.tuners.adalora.config","mro":["peft.tuners.adalora.config.AdaLoraConfig","peft.tuners.lora.config.LoraConfig","peft.config.PeftConfig","peft.config.PeftConfigMixin","transformers.utils.hub.PushToHubMixin","builtins.object"],"names":{".class":"SymbolTable","__dataclass_fields__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_classvar","is_ready"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.__dataclass_fields__","name":"__dataclass_fields__","type":{".class":"Instance","args":["builtins.str",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"dataclasses.Field"}],"extra_attrs":null,"type_ref":"builtins.dict"}},"plugin_generated":true},"__init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","base_model_name_or_path","revision","inference_mode","r","target_modules","exclude_modules","lora_alpha","lora_dropout","fan_in_fan_out","bias","use_rslora","modules_to_save","init_lora_weights","layers_to_transform","layers_pattern","rank_pattern","alpha_pattern","megatron_config","megatron_core","trainable_token_indices","loftq_config","eva_config","corda_config","use_dora","use_qalora","qalora_group_size","layer_replication","runtime_config","lora_bias","target_parameters","target_r","init_r","tinit","tfinal","deltaT","beta1","beta2","orth_reg_weight","total_step"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.__init__","name":"__init__","type":{".class":"CallableType","arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","base_model_name_or_path","revision","inference_mode","r","target_modules","exclude_modules","lora_alpha","lora_dropout","fan_in_fan_out","bias","use_rslora","modules_to_save","init_lora_weights","layers_to_transform","layers_pattern","rank_pattern","alpha_pattern","megatron_config","megatron_core","trainable_token_indices","loftq_config","eva_config","corda_config","use_dora","use_qalora","qalora_group_size","layer_replication","runtime_config","lora_bias","target_parameters","target_r","init_r","tinit","tfinal","deltaT","beta1","beta2","orth_reg_weight","total_step"],"arg_types":["peft.tuners.adalora.config.AdaLoraConfig",{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.int","builtins.float","builtins.bool",{".class":"UnionType","items":[{".class":"LiteralType","fallback":"builtins.str","value":"none"},{".class":"LiteralType","fallback":"builtins.str","value":"all"},{".class":"LiteralType","fallback":"builtins.str","value":"lora_only"}],"uses_pep604_syntax":false},"builtins.bool",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.bool",{".class":"LiteralType","fallback":"builtins.str","value":"gaussian"},{".class":"LiteralType","fallback":"builtins.str","value":"eva"},{".class":"LiteralType","fallback":"builtins.str","value":"olora"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa_niter_[number of iters]"},{".class":"LiteralType","fallback":"builtins.str","value":"corda"},{".class":"LiteralType","fallback":"builtins.str","value":"loftq"},{".class":"LiteralType","fallback":"builtins.str","value":"orthogonal"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"Instance","args":["builtins.str",{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.LoftQConfig",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.EvaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.CordaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.bool","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"peft.tuners.lora.config.LoraRuntimeConfig","builtins.bool",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.int","builtins.int","builtins.int","builtins.int","builtins.int","builtins.float","builtins.float","builtins.float",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}],"bound_args":[],"def_extras":{},"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_ellipsis_args":false,"name":"__init__ of AdaLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__init__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__init__","kind":"Mdef","plugin_generated":true},"__init__-redefinition2":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__init__","kind":"Mdef","plugin_generated":true},"__match_args__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_ready","allow_incompatible_override"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.__match_args__","name":"__match_args__","type":{".class":"TupleType","implicit":false,"items":[{".class":"LiteralType","fallback":"builtins.str","value":"task_type"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_type"},{".class":"LiteralType","fallback":"builtins.str","value":"auto_mapping"},{".class":"LiteralType","fallback":"builtins.str","value":"base_model_name_or_path"},{".class":"LiteralType","fallback":"builtins.str","value":"revision"},{".class":"LiteralType","fallback":"builtins.str","value":"inference_mode"},{".class":"LiteralType","fallback":"builtins.str","value":"r"},{".class":"LiteralType","fallback":"builtins.str","value":"target_modules"},{".class":"LiteralType","fallback":"builtins.str","value":"exclude_modules"},{".class":"LiteralType","fallback":"builtins.str","value":"lora_alpha"},{".class":"LiteralType","fallback":"builtins.str","value":"lora_dropout"},{".class":"LiteralType","fallback":"builtins.str","value":"fan_in_fan_out"},{".class":"LiteralType","fallback":"builtins.str","value":"bias"},{".class":"LiteralType","fallback":"builtins.str","value":"use_rslora"},{".class":"LiteralType","fallback":"builtins.str","value":"modules_to_save"},{".class":"LiteralType","fallback":"builtins.str","value":"init_lora_weights"},{".class":"LiteralType","fallback":"builtins.str","value":"layers_to_transform"},{".class":"LiteralType","fallback":"builtins.str","value":"layers_pattern"},{".class":"LiteralType","fallback":"builtins.str","value":"rank_pattern"},{".class":"LiteralType","fallback":"builtins.str","value":"alpha_pattern"},{".class":"LiteralType","fallback":"builtins.str","value":"megatron_config"},{".class":"LiteralType","fallback":"builtins.str","value":"megatron_core"},{".class":"LiteralType","fallback":"builtins.str","value":"trainable_token_indices"},{".class":"LiteralType","fallback":"builtins.str","value":"loftq_config"},{".class":"LiteralType","fallback":"builtins.str","value":"eva_config"},{".class":"LiteralType","fallback":"builtins.str","value":"corda_config"},{".class":"LiteralType","fallback":"builtins.str","value":"use_dora"},{".class":"LiteralType","fallback":"builtins.str","value":"use_qalora"},{".class":"LiteralType","fallback":"builtins.str","value":"qalora_group_size"},{".class":"LiteralType","fallback":"builtins.str","value":"layer_replication"},{".class":"LiteralType","fallback":"builtins.str","value":"runtime_config"},{".class":"LiteralType","fallback":"builtins.str","value":"lora_bias"},{".class":"LiteralType","fallback":"builtins.str","value":"target_parameters"},{".class":"LiteralType","fallback":"builtins.str","value":"target_r"},{".class":"LiteralType","fallback":"builtins.str","value":"init_r"},{".class":"LiteralType","fallback":"builtins.str","value":"tinit"},{".class":"LiteralType","fallback":"builtins.str","value":"tfinal"},{".class":"LiteralType","fallback":"builtins.str","value":"deltaT"},{".class":"LiteralType","fallback":"builtins.str","value":"beta1"},{".class":"LiteralType","fallback":"builtins.str","value":"beta2"},{".class":"LiteralType","fallback":"builtins.str","value":"orth_reg_weight"},{".class":"LiteralType","fallback":"builtins.str","value":"total_step"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}},"plugin_generated":true},"__match_args__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__match_args__","kind":"Mdef","plugin_generated":true},"__match_args__-redefinition2":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__match_args__","kind":"Mdef","plugin_generated":true},"__mypy-post_init":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.__mypy-post_init","name":"__mypy-post_init","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["peft.tuners.adalora.config.AdaLoraConfig"],"bound_args":[],"def_extras":{},"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_ellipsis_args":false,"name":"__mypy-post_init of AdaLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__mypy-post_init-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__mypy-post_init","kind":"Mdef","plugin_generated":true},"__mypy-post_init-redefinition2":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__mypy-post_init","kind":"Mdef","plugin_generated":true},"__mypy-replace":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Decorator","func":{".class":"FuncDef","abstract_status":0,"arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","base_model_name_or_path","revision","inference_mode","r","target_modules","exclude_modules","lora_alpha","lora_dropout","fan_in_fan_out","bias","use_rslora","modules_to_save","init_lora_weights","layers_to_transform","layers_pattern","rank_pattern","alpha_pattern","megatron_config","megatron_core","trainable_token_indices","loftq_config","eva_config","corda_config","use_dora","use_qalora","qalora_group_size","layer_replication","runtime_config","lora_bias","target_parameters","target_r","init_r","tinit","tfinal","deltaT","beta1","beta2","orth_reg_weight","total_step"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_static","is_decorated"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.__mypy-replace","name":"__mypy-replace","type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","base_model_name_or_path","revision","inference_mode","r","target_modules","exclude_modules","lora_alpha","lora_dropout","fan_in_fan_out","bias","use_rslora","modules_to_save","init_lora_weights","layers_to_transform","layers_pattern","rank_pattern","alpha_pattern","megatron_config","megatron_core","trainable_token_indices","loftq_config","eva_config","corda_config","use_dora","use_qalora","qalora_group_size","layer_replication","runtime_config","lora_bias","target_parameters","target_r","init_r","tinit","tfinal","deltaT","beta1","beta2","orth_reg_weight","total_step"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.int","builtins.float","builtins.bool",{".class":"UnionType","items":[{".class":"LiteralType","fallback":"builtins.str","value":"none"},{".class":"LiteralType","fallback":"builtins.str","value":"all"},{".class":"LiteralType","fallback":"builtins.str","value":"lora_only"}],"uses_pep604_syntax":false},"builtins.bool",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.bool",{".class":"LiteralType","fallback":"builtins.str","value":"gaussian"},{".class":"LiteralType","fallback":"builtins.str","value":"eva"},{".class":"LiteralType","fallback":"builtins.str","value":"olora"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa_niter_[number of iters]"},{".class":"LiteralType","fallback":"builtins.str","value":"corda"},{".class":"LiteralType","fallback":"builtins.str","value":"loftq"},{".class":"LiteralType","fallback":"builtins.str","value":"orthogonal"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"Instance","args":["builtins.str",{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.LoftQConfig",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.EvaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.CordaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.bool","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"peft.tuners.lora.config.LoraRuntimeConfig","builtins.bool",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.int","builtins.int","builtins.int","builtins.int","builtins.int","builtins.float","builtins.float","builtins.float",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}],"bound_args":[],"def_extras":{},"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_ellipsis_args":false,"name":"__mypy-replace of AdaLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"is_overload":false,"var":{".class":"Var","flags":["is_staticmethod","is_ready"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.__mypy-replace","name":"__mypy-replace","type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","base_model_name_or_path","revision","inference_mode","r","target_modules","exclude_modules","lora_alpha","lora_dropout","fan_in_fan_out","bias","use_rslora","modules_to_save","init_lora_weights","layers_to_transform","layers_pattern","rank_pattern","alpha_pattern","megatron_config","megatron_core","trainable_token_indices","loftq_config","eva_config","corda_config","use_dora","use_qalora","qalora_group_size","layer_replication","runtime_config","lora_bias","target_parameters","target_r","init_r","tinit","tfinal","deltaT","beta1","beta2","orth_reg_weight","total_step"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.int","builtins.float","builtins.bool",{".class":"UnionType","items":[{".class":"LiteralType","fallback":"builtins.str","value":"none"},{".class":"LiteralType","fallback":"builtins.str","value":"all"},{".class":"LiteralType","fallback":"builtins.str","value":"lora_only"}],"uses_pep604_syntax":false},"builtins.bool",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.bool",{".class":"LiteralType","fallback":"builtins.str","value":"gaussian"},{".class":"LiteralType","fallback":"builtins.str","value":"eva"},{".class":"LiteralType","fallback":"builtins.str","value":"olora"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa"},{".class":"LiteralType","fallback":"builtins.str","value":"pissa_niter_[number of iters]"},{".class":"LiteralType","fallback":"builtins.str","value":"corda"},{".class":"LiteralType","fallback":"builtins.str","value":"loftq"},{".class":"LiteralType","fallback":"builtins.str","value":"orthogonal"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"Instance","args":["builtins.str",{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.LoftQConfig",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.EvaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.lora.config.CordaConfig",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.bool","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"peft.tuners.lora.config.LoraRuntimeConfig","builtins.bool",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.int","builtins.int","builtins.int","builtins.int","builtins.int","builtins.float","builtins.float","builtins.float",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}],"bound_args":[],"def_extras":{},"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_ellipsis_args":false,"name":"__mypy-replace of AdaLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"plugin_generated":true},"__mypy-replace-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__mypy-replace","kind":"Mdef","plugin_generated":true},"__mypy-replace-redefinition2":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adalora.config.AdaLoraConfig.__mypy-replace","kind":"Mdef","plugin_generated":true},"__post_init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.__post_init__","name":"__post_init__","type":null}},"beta1":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.beta1","name":"beta1","type":"builtins.float"}},"beta2":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.beta2","name":"beta2","type":"builtins.float"}},"deltaT":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.deltaT","name":"deltaT","type":"builtins.int"}},"init_r":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.init_r","name":"init_r","type":"builtins.int"}},"orth_reg_weight":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.orth_reg_weight","name":"orth_reg_weight","type":"builtins.float"}},"rank_pattern":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.rank_pattern","name":"rank_pattern","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":5}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}}},"target_r":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.target_r","name":"target_r","type":"builtins.int"}},"tfinal":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.tfinal","name":"tfinal","type":"builtins.int"}},"tinit":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.tinit","name":"tinit","type":"builtins.int"}},"total_step":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adalora.config.AdaLoraConfig.total_step","name":"total_step","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}}},"self_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adalora.config.AdaLoraConfig.Self","id":0,"name":"Self","namespace":"","upper_bound":"peft.tuners.adalora.config.AdaLoraConfig","values":[],"variance":0},"slots":null,"tuple_type":null,"type_vars":[],"typeddict_type":null}},"LoraConfig":{".class":"SymbolTableNode","cross_ref":"peft.tuners.lora.config.LoraConfig","kind":"Gdef","module_hidden":true,"module_public":false},"Optional":{".class":"SymbolTableNode","cross_ref":"typing.Optional","kind":"Gdef","module_hidden":true,"module_public":false},"PeftType":{".class":"SymbolTableNode","cross_ref":"peft.utils.peft_types.PeftType","kind":"Gdef","module_hidden":true,"module_public":false},"__annotations__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adalora.config.__annotations__","name":"__annotations__","type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__doc__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adalora.config.__doc__","name":"__doc__","type":"builtins.str"}},"__file__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adalora.config.__file__","name":"__file__","type":"builtins.str"}},"__name__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adalora.config.__name__","name":"__name__","type":"builtins.str"}},"__package__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adalora.config.__package__","name":"__package__","type":"builtins.str"}},"__spec__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adalora.config.__spec__","name":"__spec__","type":"_frozen_importlib.ModuleSpec"}},"dataclass":{".class":"SymbolTableNode","cross_ref":"dataclasses.dataclass","kind":"Gdef","module_hidden":true,"module_public":false},"field":{".class":"SymbolTableNode","cross_ref":"dataclasses.field","kind":"Gdef","module_hidden":true,"module_public":false},"warnings":{".class":"SymbolTableNode","cross_ref":"warnings","kind":"Gdef","module_hidden":true,"module_public":false}},"path":"/Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/peft/tuners/adalora/config.py"}